app/Http/Controllers/AccountController.php

    public function profile()
    {
        // To get the id of user
        $id = Auth::user()->id;

        // $user = User::where('id', $id)->first();
        // or
        $user = User::find($id);
---
select * from `users` where `users`.`id` = 1 limit 1

    public function postJob()
    {
        $categories = Category::orderBy('name', 'ASC')->where('status', 1)->get();

        $jobTypes = JobType::orderBy('name', 'ASC')->where('status', 1)->get();
---
select * from `categories` where `status` = 1 order by `name` asc
select * from `job_types` where `status` = 1 order by `name` asc

    public function myJobs()
    {
        $jobs = Job::where('user_id', Auth::user()->id)->with('jobType')->orderBy('created_at', 'DESC')->paginate(10);
---
select * from `job_types` where `job_types`.`id` in (1, 2, 3, 4, 5)