app/Http/Controllers/HomeController.php

    public function index()
    {
        $categories = category::where('status', 1)
                    ->orderBy('name', 'ASC')
                    ->take(8)->get();

        $newcategories = category::where('status', 1)
                    ->orderBy('name', 'ASC')
                    ->get();

        // $latestJob = JobType::where('status', 1)->get();

        $featuredJobs = Job::where('status', 1)
                        ->orderBy('created_at', 'DESC')
                        ->with('jobType')
                        ->where('isFeatured', 1)
                        ->take(6)->get();

        $latestJobs = Job::where('status', 1)
                        ->with('jobType')
                        ->orderBy('created_at', 'DESC')
                        ->take(6)->get();
---
select * from `job_types` where `job_types`.`id` in (2, 3, 4, 5)