app/Http/Controllers/JobController.php

    public function jobs(Request $request){
        $categories = category::where('status', 1)->get();
        $jobTypes = JobType::where('status', 1)->get();
---
select * from `job_types` where `status` = 1

            $jobs = $jobs->where('experience', $request->experience);
        }

        $jobs = $jobs->with(['jobType', 'category'])->orderBy('created_at', 'DESC')->paginate(9);
---
select * from `categories` where `categories`.`id` in (2, 3, 4, 5)
select * from `job_types` where `job_types`.`id` in (1, 3)

    public function detail($id){

        $job = Job::Where(['id' => $id, 'status' => 1])->with('jobType')->first();
---
select * from `job_types` where `job_types`.`id` in (4)