app/Http/Controllers/JobController.php

select * from `job_types` where `job_types`.`id` in (2, 3, 4, 5)
---
    public function jobs(){
        $categories = category::where('status', 1)->get();
        $jobTypes = JobType::where('status', 1)->get();

        //with the help of with we are calling jobtype relation
        $jobs = Job::where('status', 1)->with('jobType')->orderBy('created_at', 'DESC')->paginate(9);